cache/posts/lets-go-pomodoro.html
<p>
This posts experiments a bit with some time management techniques. I
discovered it is not just a talk. You can in fact work much more
productively with basics time management techniques.
</p>

<!-- TEASER_END -->

<p>
I started using some during my last exam session. It was
a hard one and I was often distracted. Well I decided to set
timers. During some time I was working. Then I was regularly doing
breaks reading my current book. It worked and I managed to read 250
pages during the most hard exam session I ever experienced. 
</p>

<p>
It turned out when discussing with my dear, that there is a very
well known technique that supports such a behaviour. It is the
pomodoro technique. It consists in measuring everything in
pomodoros. That is 25min. intervals.
</p>

<p>
During such intervals you work at 100% without any distraction and
then from time to time you take breaks and switch off. But when you
work you work at 100%. You do not mix stuff.
</p>

<p>
Let's start with the basics in emacs. And let's then expand to the
pomodoro.
</p>


<div id="outline-container-org506b0a6" class="outline-2">
<h2 id="org506b0a6">Org-Clocks</h2>
<div class="outline-text-2" id="text-org506b0a6">
<p>
So the basic thing is to log all of your work. I.e. check how much
time you needed to compute tasks. After all: <i>just if you can
measure it, you can improve it</i>. 
</p>

<p>
One very easy way to do that in emacs is via the <code>org-clock-in</code>
function mapped to <code>C-c C-x TAB</code>, in my emacs. Its correspondent is
<code>org-clock-out</code> mapped to <code>C-c C-x C-o</code>. In such a way you will be
able to start a measurement in the org header and stop it. The time
of the clock will be registered in the logbook. Check this very
org file you are editing should you be confused at any time. 
</p>

<p>
Also interesting are the <code>C-c C-x C-j</code>, i.e. the <code>org-clock-goto</code>
command. This makes you jump to the header where your clocks are
registered. Even more interesting is the <code>C-c C-x C-d</code> command,
i.e. <code>org-clock-display</code> command. When you run this in the section
it tells you exactly how many hours you spend on the section
according to your clocked in time.
</p>

<p>
Well, that all came in by default with emacs <code>org-mode</code>. I just
have never had the time so far to check at it properly and to make
sense of all of that. Now that I am taking the time and writing
this post it makes well sense to work in such a way. Wonderful
tool. Quick usage through the shortcuts.
</p>
</div>
</div>

<div id="outline-container-org8dfe574" class="outline-2">
<h2 id="org8dfe574">Pomodoro</h2>
<div class="outline-text-2" id="text-org8dfe574">
<p>
Let's go back to the pomodoro technique, the thing for which you
actually started to dig into such time management tools. So
apparently tools to work with the pomodoro technique were
implemented <i>en mass</i> into emacs. Well no surprise. If you know
emacs, then you know we emacs people value a lot productivity and
try all the sorts of the escamotages in order to increase it.
</p>

<p>
So the most popular package is the pomodoro one. You can install it
as follows given that you are using the <code>use-package</code> package. 
</p>

<div class="highlight"><pre><span></span> <span class="c1">;; could not find it normally.</span>
 <span class="c1">;; (use-package pomodoro</span>
 <span class="c1">;;   :ensure t</span>
 <span class="c1">;;   :init (pomodoro-add-to-mode-line))</span>


 <span class="c1">;; use the quelpa mirror because of that</span>
  <span class="p">(</span><span class="nf">use-package</span> <span class="nv">pomodoro</span>
    <span class="nv">:quelpa</span> <span class="p">(</span><span class="nf">pomodoro</span> <span class="nv">:fetcher</span> <span class="nv">github</span> <span class="nv">:repo</span> <span class="s">&quot;emacsmirror/pomodoro&quot;</span><span class="p">)</span>
    <span class="nv">:config</span> <span class="p">(</span><span class="nf">pomodoro-add-to-mode-line</span><span class="p">)</span>
    <span class="nv">:bind</span> <span class="p">((</span><span class="s">&quot;C-c C-v s-p&quot;</span> <span class="o">.</span> <span class="nv">pomodoro-start</span><span class="p">)</span>
	   <span class="p">(</span><span class="s">&quot;C-c C-v s-s&quot;</span> <span class="o">.</span> <span class="nv">pomodoro-stop</span><span class="p">))</span>
	   <span class="p">(</span><span class="s">&quot;C-c C-x s-p&quot;</span> <span class="o">.</span> <span class="nv">pomodoro-pause</span><span class="p">)</span>
	   <span class="p">(</span><span class="s">&quot;C-c C-x s-r&quot;</span> <span class="o">.</span> <span class="nv">pomodoro-resume</span><span class="p">))</span>
    <span class="p">)</span>
</pre></div>


<p>
Good with the above quelpa mirror you managed to install it. Notice
that here the functions to start your pomodoro timer is
<code>pomodoro-start</code>. There are then a couple of functions to <code>pause</code>,
<code>resume</code> etc. your pomodoro. Notice that here the time with the
add-to-mode-line above is displayed in little on the bottom left of
your mode-line. That is fine. Use this in general and not when
editing org files. For this there is a better option that we will
explore next.
</p>

<p>
Another option that directly integrates with emacs org
mode clocks previously described is the <code>org-pomodoro</code>
package. That starts a clock as the <code>clock-in</code> command above and
after 25 min. it should expire. I read that the notification when
it expires is not that great so they suggested to add the
<code>libnotify</code> option below.
</p>

<div class="highlight"><pre><span></span> <span class="p">(</span><span class="nf">use-package</span> <span class="nv">org-pomodoro</span>
   <span class="nv">:ensure</span> <span class="nv">t</span>
   <span class="nv">:config</span>
   <span class="p">(</span><span class="nf">setq</span> <span class="nv">alert-user-configuration</span> <span class="p">(</span><span class="k">quote </span><span class="p">((((</span><span class="nf">:category</span> <span class="o">.</span> <span class="s">&quot;org-pomodoro&quot;</span><span class="p">))</span> <span class="nv">libnotify</span> <span class="nv">nil</span><span class="p">)))))</span>
</pre></div>

<p>
Let's give it a go for the next task then. Now I have no time to
wait other 25min. to see the behaviour. The milestone was set and
for the next projects you can start with your time management
techniques.
</p>

<p>
Good you are done and at this first round of your management tool, you
spent exactly 38 min. exploring such options and writing this
post. And recall: <i>if you don't measure it, you cannot improve it</i>.
</p>

<p>
Ahh and by the way, just noticed that your pomodoro time does
indeed appear on the lower bar even when using org-pomodoro. So
good you are good to go. Let's pomodoro it all.
</p>
</div>
</div>
